In [1]:
import pandas as pd

# Introduction to pandas Data Structures
<b> Pandas has two main data structions , <i> Series </i> and <i>DataFrames</i>

## Pandas Series

In [6]:
ser=pd.Series(data=[100,'two',300,400,500],index=["tom","bob","harley","Bajaj","Tata"])
ser

tom       100
bob       two
harley    300
Bajaj     400
Tata      500
dtype: object

In [7]:
print(ser.index)

Index(['tom', 'bob', 'harley', 'Bajaj', 'Tata'], dtype='object')

In [14]:
#searching by index
ser['Tata']

500

In [15]:
ser.loc['Tata'] # above line and this is same

500

In [16]:
ser.loc[['Tata','tom']] # searching with multiples indices

Tata    500
tom     100
dtype: object

In [17]:
ser[0] # searching with array index

100

In [12]:
ser[[0,1,2]]

tom       100
bob       two
harley    300
dtype: object

In [18]:
ser.iloc[[1,2,3]] # searching with array index usinf iloc

bob       two
harley    300
Bajaj     400
dtype: object

In [20]:
'tom' in ser

True

In [21]:
'dick' in ser

False

In [22]:
# multiplying the data by  certain scalar

print(ser)
print()
print(ser *2)

tom       100
bob       two
harley    300
Bajaj     400
Tata      500
dtype: object

tom          200
bob       twotwo
harley       600
Bajaj        800
Tata        1000
dtype: object

In [25]:
# making data of the series rise to certain power
#but first let me make value of bob two integer cause
#power() cant ve done for string
ser['bob']=200
print(ser)

print()
print(ser**2)

tom       100
bob       200
harley    300
Bajaj     400
Tata      500
dtype: object

tom        10000
bob        40000
harley     90000
Bajaj     160000
Tata      250000
dtype: object

## Data Frames

#### While series is 1-dimensional labelled array
#### Dataframe is 2-dimensional

###  Create Dataframe from dictionary of Python Series

In [27]:
dicti={'one':pd.Series([100,200,300],index=['apple','ball','clock']),
    'two':pd.Series([400,500,600],index=['dog','egg','fox'])
}

In [29]:
print(dicti)

{'two': dog    400
egg    500
fox    600
dtype: int64, 'one': apple    100
ball     200
clock    300
dtype: int64}

In [30]:
df=pd.DataFrame(dicti)
print(df)

         one    two
apple  100.0    NaN
ball   200.0    NaN
clock  300.0    NaN
dog      NaN  400.0
egg      NaN  500.0
fox      NaN  600.0

In [31]:
df.index

Index(['apple', 'ball', 'clock', 'dog', 'egg', 'fox'], dtype='object')

In [32]:
df.columns

Index(['one', 'two'], dtype='object')

In [33]:
pd.DataFrame(dicti,index=['clock','dog'])

         one    two
clock  300.0    NaN
dog      NaN  400.0

In [36]:
pd.DataFrame(dicti,index=['apple','fox'],columns=['one','two','five'])

         one    two five
apple  100.0    NaN  NaN
fox      NaN  600.0  NaN

### Creating DataFrame from list of python dictionaries

In [37]:
data=[{'alex':1,'joe':2},{'john':3,'doe':4}]
print(data)

[{'alex': 1, 'joe': 2}, {'doe': 4, 'john': 3}]

In [39]:
pd.DataFrame(data)

   alex  doe  joe  john
0   1.0  NaN  2.0   NaN
1   NaN  4.0  NaN   3.0

In [40]:
pd.DataFrame(data,index=['orange','banana'])

        alex  doe  joe  john
orange   1.0  NaN  2.0   NaN
banana   NaN  4.0  NaN   3.0

In [41]:
pd.DataFrame(data,columns=['joe','doe'])

   joe  doe
0  2.0  NaN
1  NaN  4.0

## Basic DataFrame Operations

In [42]:
df

         one    two
apple  100.0    NaN
ball   200.0    NaN
clock  300.0    NaN
dog      NaN  400.0
egg      NaN  500.0
fox      NaN  600.0

In [43]:
df['one']

apple    100.0
ball     200.0
clock    300.0
dog        NaN
egg        NaN
fox        NaN
Name: one, dtype: float64

In [46]:
df.loc['apple']

one    100.0
two      NaN
Name: apple, dtype: float64

In [48]:
df.iloc[1]

one    200.0
two      NaN
Name: ball, dtype: float64

In [57]:
df['three']=df['one']*df['two']
df
#number + or any operiation of it with Nan is Nan only

         one    two  filter  three
apple  100.0    NaN   False    NaN
ball   200.0    NaN   False    NaN
clock  300.0    NaN    True    NaN
dog      NaN  400.0   False    NaN
egg      NaN  500.0   False    NaN
fox      NaN  600.0   False    NaN

In [58]:
df['filter']=df['one']>200
df

         one    two  filter  three
apple  100.0    NaN   False    NaN
ball   200.0    NaN   False    NaN
clock  300.0    NaN    True    NaN
dog      NaN  400.0   False    NaN
egg      NaN  500.0   False    NaN
fox      NaN  600.0   False    NaN

In [59]:
# removing a column from a dataframe
three=df.pop('three')
print(three)
print()
print(df)

apple   NaN
ball    NaN
clock   NaN
dog     NaN
egg     NaN
fox     NaN
Name: three, dtype: float64

         one    two  filter
apple  100.0    NaN   False
ball   200.0    NaN   False
clock  300.0    NaN    True
dog      NaN  400.0   False
egg      NaN  500.0   False
fox      NaN  600.0   False

In [60]:
df

         one    two  filter
apple  100.0    NaN   False
ball   200.0    NaN   False
clock  300.0    NaN    True
dog      NaN  400.0   False
egg      NaN  500.0   False
fox      NaN  600.0   False

In [61]:
# Or we can use del too
del df['filter']
print(df)

         one    two
apple  100.0    NaN
ball   200.0    NaN
clock  300.0    NaN
dog      NaN  400.0
egg      NaN  500.0
fox      NaN  600.0

In [65]:
df.insert(2,'copy_of_two',df['one'])  # here 2 is the column no 
print(df)

         one    two  copy_of_two  copy_of_one
apple  100.0    NaN        100.0        100.0
ball   200.0    NaN        200.0        200.0
clock  300.0    NaN        300.0        300.0
dog      NaN  400.0          NaN          NaN
egg      NaN  500.0          NaN          NaN
fox      NaN  600.0          NaN          NaN

In [67]:
df['one_upper_half']=df['one'][:2]
df

         one    two  copy_of_two  copy_of_one  one_upper_half
apple  100.0    NaN        100.0        100.0           100.0
ball   200.0    NaN        200.0        200.0           200.0
clock  300.0    NaN        300.0        300.0             NaN
dog      NaN  400.0          NaN          NaN             NaN
egg      NaN  500.0          NaN          NaN             NaN
fox      NaN  600.0          NaN          NaN             NaN